{
  "backend/main.mo": "Main backend actor implementing user profiles, video gallery, merchandise store, podcast episodes, and Stripe payment integration with role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report documenting implementation of sherrishowtv.com-inspired design across navigation, hero sections, video galleries, store pages, and podcast layouts while maintaining Sittin with Shireen branding.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the redesigned UI components, pages, and styling that match sherrishowtv.com aesthetics with fuchsia pink and orange branding.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark themes, including neutral base colors with custom chart, sidebar, and destructive color tokens.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Sittin with Shireen', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, videos, store, podcast, admin, and payment pages, wrapped in theme, music, and cart context providers.",
  "frontend/src/components/admin/EpisodeManager.tsx": "Admin interface for managing podcast episodes with form for adding/editing episodes (title, description, audio URL) and list view with edit/delete actions.",
  "frontend/src/components/admin/ProductManager.tsx": "React component for managing products with CRUD operations, including form handling for product name, description, price, and image upload with progress tracking.",
  "frontend/src/components/admin/StripeSetup.tsx": "React component for configuring Stripe payment processing, allowing admins to set the secret key and allowed countries for payment processing.",
  "frontend/src/components/admin/VideoUpload.tsx": "React component for uploading videos with ID and file selection, displaying upload progress using ExternalBlob with progress tracking.",
  "frontend/src/components/AudioPlayer.tsx": "Fixed bottom audio player component with play/pause, seek slider, volume controls, mute toggle, and time display for podcast episodes.",
  "frontend/src/components/BackgroundMusicPlayer.tsx": "Floating bottom-right music player widget with play/pause button, mute toggle, and volume slider using MusicContext.",
  "frontend/src/components/EpisodeCard.tsx": "Podcast episode card component displaying title, description, and play/pause button with hover effects and clean border styling.",
  "frontend/src/components/Footer.tsx": "Footer component displaying three columns (About, Quick Links, Social Media) with navigation links, social media icons, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Header component with logo and login/logout button that uses Internet Identity authentication and manages query cache on logout.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that composes Header, Navigation, Footer, and renders children in a flex column structure.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with Home, Videos, Store, Podcast links (and Admin for admin users), showing active state and icons for each route.",
  "frontend/src/components/ProductCard.tsx": "Product display card showing image, name, description, and price with an \"Add to Cart\" button that integrates with the cart context.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name before continuing, blocking interaction until completed.",
  "frontend/src/components/ShoppingCart.tsx": "Shopping cart component displaying cart items with quantity controls, total price calculation, and a checkout button that creates a Stripe session.",
  "frontend/src/components/VideoCard.tsx": "Video thumbnail card with play button overlay that displays a video preview and triggers a callback when clicked.",
  "frontend/src/components/VideoPlayer.tsx": "Full-screen modal video player with close button and escape key support for dismissing the overlay.",
  "frontend/src/context/CartContext.tsx": "React context provider for shopping cart functionality with localStorage persistence, managing cart items, quantities, and total price calculations.",
  "frontend/src/context/MusicContext.tsx": "React context provider for background music playback with controls for play/pause, volume, and mute, persisting preferences to localStorage.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, videos, products, episodes, shopping items, and Stripe configuration via the actor backend. Each hook manages query/mutation state and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using fuchsia pink primary and orange secondary colors. Includes base typography styles for headings and body text.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers. Imports global CSS styles.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with role-based access control that displays tabs for managing videos, products, podcast episodes, and Stripe configuration. Redirects non-admin users to home.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, about section, and feature cards linking to videos, podcast, and store. Displays show branding and call-to-action buttons.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page displaying error message with options to retry shopping or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page with options to continue shopping or return home.",
  "frontend/src/pages/Podcast.tsx": "Podcast episodes listing page that displays episode cards and manages audio playback with a persistent player component.",
  "frontend/src/pages/Store.tsx": "E-commerce store page displaying product grid and sticky shopping cart sidebar using cart context.",
  "frontend/src/pages/Videos.tsx": "Video gallery page displaying video cards in a responsive grid with modal video player for playback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space, container settings, border radius variables, box shadows, and font families with typography and animation plugins.",
  "project_state.json": "Project state file for 'Sittin with Shireen' talk show website tracking implemented features including homepage, video gallery, merchandise store, podcast page, background music player, and brand theming with fuchsia pink and orange colors."
}